import styles from './aboutUs.module.css'
import Image from 'next/image'
import { useEffect } from 'react'

import AOS from 'aos'
import 'aos/dist/aos.css'

import{NextSeo} from 'next-seo'


const AboutUs = () =>{

    const SEO = {
        title: "Пекарна Дивото Брашно | За Нас",
        description: "Повече За Нас | Пекарна Дивото Брашно Варна",
    
        openGraph:{
            title: "Пекарна Дивото Брашно | За Нас",
            description: "Повече За Нас | Пекарна Дивото Брашно Варна",
        }
    }

    useEffect(() => {
        AOS.init({
          // duration : 5000
        });
      }, []);

    return(
        <main>
        <NextSeo {...SEO} />
        <div className={styles.about}>
            <h1 className={styles.h1} data-aos="zoom-in-up">ЗА НАС</h1>
            <div className={styles.aboutEl}>
                <div className={styles.aboutText}>
                    <p>Пекарна Дивото брашно отвори врати през 2013г. на ул. Кн. Николаевич с малък персонал и асортимент от тестени изделия, но с мисията да покаже качествата на своите професионалисти в бранша и с енергията да се превърне в любимо място на мнозина в град Варна.</p>
                    <p>През 2015г. към вече обикновените закуски и хляб добавихме разнообразие от здравословни пълнозърнести и сладки изделия,накарали голям брой клиенти от различни точки на града, както и извън него, да ни посетят. През същата година се роди втората пекарна от нашето семейство, която може да откриете на пазар Чаталджа. Със слънчевата си и приветлива обстановка тя е перфектното място за закуска или обяд, придружени от кафе или чай.</p>
                    <p>Ние посетихме различни кътчета на България, за да открием най-вкусните рецепти. Използваме качествено брашно, млечни продукти, яйца и слънчогледово олио, произведени в нашата родина. Нашите изделия, сред които нито едно в замразено състояние, се приготвят по традиционни български рецепти, които осъвършенствахме и добавихме скъпи продукти като синьо сирене и висококачествен кашкавал Гауда. Резултатът е комбинация от различни вкусове, подходящи за всеки.</p>
                    <p>Създадохме мястото със сърце и ръце. Благодарение на нашите верни приятели и отдадеността на персонала към качеството и отличността, пекарна Дивото брашно доби изключителна популярност.
                    </p>
                    <p>Благодарим Ви, че споделяте Вашето време с нас!</p>
                </div>
                <div>
                    <div className={styles.aboutImg1}> <Image  src="/AboutUs_img.webp" width={817} height={998} alt="Дивото Брашно" /></div>
                   <div className={styles.aboutImg2}><Image  src="/AboutUs_2_img_03.webp" width={295} height={490} alt="Дивото Брашно" /></div>
                    
                </div>
            </div>
        </div>
    </main>
    )
}

export default AboutUs